%% 1) 三基色参数（必须和 RGB_to_xyY 里保持一致）
xr = 0.69;  yr = 0.31;  Yr = 1.4;
xg = 0.17;  yg = 0.72;  Yg = 2.2;
xb = 0.15;  yb = 0.03;  Yb = 0.5;

% 计算三基色 XYZ
Xr = Yr/yr * xr;
Xg = Yg/yg * xg;
Xb = Yb/yb * xb;

Zr = Yr/yr * (1 - xr - yr);
Zg = Yg/yg * (1 - xg - yg);
Zb = Yb/yb * (1 - xb - yb);

M = [Xr, Xg, Xb;
     Yr, Yg, Yb;
     Zr, Zg, Zb];      % 3×3


%% 2. 你的 Cx、Cy、亮度配比表（逐行对应）
% data = [
% 0.307  0.315  1.00;
% 0.185  0.104  0.37;
% 0.154  0.086  0.30;
% 0.176  0.267  0.45;
% 0.190  0.440  0.62;
% 0.471  0.492  0.72;
% 0.568  0.406  0.51;
% 0.674  0.305  0.27;
% 0.361  0.364  1.00;
% 0.264  0.268  1.00;
% 0.614  0.280  0.32;
% 0.455  0.212  0.32;
% 0.379  0.171  0.37;
% 0.194  0.100  0.37;
% 0.148  0.070  0.30;
% 0.154  0.181  0.45;
% 0.350  0.493  0.67;
% 0.401  0.531  0.72;
% 0.618  0.359  0.39;
% 0.224  0.176  0.45;
% 0.183  0.201  0.45;
% 0.228  0.286  0.62;
% 0.257  0.369  0.51;
% 0.331  0.413  0.67;
% 0.397  0.412  0.72;
% 0.488  0.378  0.51;
% 0.440  0.355  0.39;
% 0.541  0.348  0.32;
% 0.461  0.298  0.32;
% 0.389  0.259  0.32;
% 0.295  0.217  0.45
% ];
% data = [
% 0.281  0.290  21.5;
% 0.177  0.099  13.1;
% 0.327  0.528  17.8;
% 0.625  0.342  15.8;
% 0.213  0.117  16.7;
% 0.195  0.208  19.6;
% 0.461  0.465  23;
% 0.570  0.384  18.36
% ];
data = [
0.281  0.290  9.7;
0.177  0.099  3;
0.327  0.528  8;
0.625  0.342  3.3;
0.213  0.117  3.8;
0.195  0.208  7.6;
0.461  0.465  7.1;
0.570  0.384  4.1
];
Cx = data(:,1);   % N×1
Cy = data(:,2);   % N×1
Y  = data(:,3);   % N×1 亮度配比

%% 3) 读入 xy 和亮度配比
Cx      = data(:,1);     % N×1
Cy      = data(:,2);     % N×1
Y_ratio = data(:,3);     % N×1 亮度配比

% 可以整体乘一个系数，控制整体亮度标尺
Y0 = 1;                  % 或者选 100、3.3914 等
Y  = Y_ratio * Y0;       % 真正送进 XYZ 计算的 Y

% 批量 xyY -> XYZ
X = Cx ./ Cy .* Y;
Z = (1 - Cx - Cy) ./ Cy .* Y;

XYZ = [X, Y, Z].';       % 3×N，每一列是一个颜色


%% 3) 解线性 RGB（物理强度权重）
RGB_lin = M \ XYZ;       % 3×N

% 数值误差导致的小负数裁掉
RGB_lin(RGB_lin < 0) = 0;
XYZ_back = M * RGB_lin;      % 理论上 ≈ XYZ
Y_back   = XYZ_back(2,:).';  % N×1

ratio_back = Y_back / Y_back(1);

%% 4) 全局统一缩放到 0~255
max_all   = max(RGB_lin(:));           % 所有颜色、所有通道中的最大值
RGB_norm  = RGB_lin / max_all;         % 大家统一除以同一个 max_all
RGB255    = uint8(round(RGB_norm * 255));  % 3×N

% 如果想 N×3 每行一个 [R G B]
RGB255_row = RGB255.';                 % N×3

% 拼一个总表看一下
result = [data, double(RGB255_row)];
disp(result);


%% 5) 验证：用 0~255 的 RGB 反推 xyY
N = size(RGB255_row,1);
xyY_back = zeros(N,3);

for i = 1:N
    RGB = double(RGB255_row(i,:));   % 注意转 double

    xyY_back(i,:) = RGB_to_xyY( ...
        RGB, ...
        xr, yr, Yr, ...
        xg, yg, Yg, ...
        xb, yb, Yb);
end

% 对比亮度比例
Y_back      = xyY_back(:,3);
ratio_back2 = Y_back / Y_back(1);

table(Y_ratio, ratio_back2)

